<?php

namespace Database\Seeders;

use Carbon\Carbon;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Seeder;

class CitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        $names = ["آبادان","آباده","آبدانان","آبیک","آذرشهر","آرادان","آران وبیدگل","آزادشهر","آستارا","آستانه اشرفیه","آشتیان","آغاجاری","آق قلا","آمل","آوج","ابرکوه","ابوموسی","ابهر","اراک","اردبیل","اردستان","اردکان","اردل","ارزوییه","ارسنجان","ارومیه","ازنا","استهبان","اسدآباد","اسفراین","اسکو","اسلام آبادغرب","اسلامشهر","اشتهارد","اشکذر","اشنویه","اصفهان","اصلاندوز","اقلید","البرز","الیگودرز","املش","امیدیه","انار","اندیکا","اندیمشک","اوز","اهر","اهواز","ایجرود","ایذه","ایرانشهر","ایلام","ایوان","بابل","بابلسر","باخرز","باشت","باغ ملک","بافت","بافق","بانه","باوی","بجستان","بجنورد","بختگان","بدره","برخوار","بردسکن","بردسیر","بروجرد","بروجن","بستان آباد","بستک","بشاگرد","بشرویه","بم","بمپور","بن","بناب","بندرانزلی","بندرعباس","بندرگز","بندرلنگه","بندرماهشهر","بو یین و میاندشت","بوانات","بوشهر","بوکان","بویراحمد","بویین زهرا","بهاباد","بهار","بهارستان","بهبهان","بهشهر","بهمیی","بیجار","بیرجند","بیضا","بیله سوار","بینالود","پارس آباد","پارسیان","پاسارگاد","پاکدشت","پاوه","پردیس","پلدختر","پلدشت","پیرانشهر","پیشوا","تاکستان","تایباد","تبریز","تربت جام","تربت حیدریه","ترکمن","تفت","تفتان","تفرش","تکاب","تنکابن","تنگستان","تویسرکان","تهران","تیران وکرون","ثلاث باباجانی","جاجرم","جاسک","جغتای","جلفا","جم","جوانرود","جویبار","جوین","جهرم","جیرفت","چادگان","چاراویماق","چالدران","چالوس","چاه بهار","چایپاره","چرام","چرداول","چگنی","چناران","حاجی اباد","حمیدیه","خاتم","خاش","خانمیرزا","خداآفرین","خدابنده","خرامه","خرم آباد","خرم بید","خرمدره","خرمشهر","خفر","خلخال","خلیل آباد","خمیر","خمین","خمینی شهر","خنج","خنداب","خواف","خوانسار","خور و بیابانک","خوسف","خوشاب","خوی","داراب","دالاهو","دامغان","داورزن","درگز","درگزین","درمیان","دره شهر","دزفول","دشت آزادگان","دشتستان","دشتی","دشتیاری","دلفان","دلگان","دلیجان","دماوند","دنا","دورود","دهاقان","دهگلان","دهلران","دیر","دیلم","دیواندره","رابر","راز و جرگلان","راسک","رامسر","رامشیر","رامهرمز","رامیان","راور","رباط کریم","رزن","رستم","رشت","رشتخوار","رضوانشهر","رفسنجان","روانسر","رودان","رودبار","رودبارجنوب","رودسر","رومشکان","ری","ریگان","زابل","زاوه","زاهدان","زرقان","زرند","زرندیه","زرین دشت","زنجان","زهک","زیرکوه","ساری","سامان","ساوجبلاغ","ساوه","سبزوار","سپیدان","سراب","سراوان","سرایان","سرباز","سربیشه","سرپل ذهاب","سرچهان","سرخس","سرخه","سردشت","سرعین","سروآباد","سروستان","سقز","سلسله","سلطانیه","سلماس","سمنان","سمیرم","سنقر","سنندج","سوادکوه","سوادکوه شمالی","سیاهکل","سیب و سوران","سیرجان","سیروان","سیریک","سیمرغ","شادگان","شازند","شاهرود","شاهین دژ","شاهین شهرومیمه","شبستر","شفت","شمیرانات","شوش","شوشتر","شوط","شهربابک","شهرضا","شهرکرد","شهریار","شیراز","شیروان","صالح آباد","صحنه","صومعه سرا","طارم","طالقان","طبس","طوالش","عباس آباد","عجب شیر","عسلویه","علی آباد کتول","عنبرآباد","فارسان","فاروج","فاریاب","فامنین","فراشبند","فراهان","فردوس","فردیس","فریدن","فریدونشهر","فریدونکنار","فریمان","فسا","فلاورجان","فنوج","فومن","فهرج","فیروزآباد","فیروزکوه","فیروزه","قایم شهر","قاینات","قدس","قرچک","قروه","قزوین","قشم","قصرشیرین","قصرقند","قلعه گنج","قم","قوچان","قیروکارزین","کارون","کازرون","کاشان","کاشمر","کامیاران","کبودرآهنگ","کرج","کردکوی","کرمان","کرمانشاه","کلات","کلاردشت","کلاله","کلیبر","کمیجان","کنارک","کنگان","کنگاور","کوار","کوثر","کوه چنار","کوهبنان","کوهدشت","کوهرنگ","کوهسرخ","کهگیلویه","کهنوج","کیار","گالیکش","گتوند","گچساران","گراش","گرگان","گرمسار","گرمه","گرمی","گلپایگان","گلوگاه","گمیشان","گناباد","گناوه","گنبدکاووس","گیلانغرب","لارستان","لالی","لامرد","لاهیجان","لردگان","لنجان","لنده","لنگرود","مارگون","ماسال","ماکو","مانه وسملقان","ماهنشان","مبارکه","محلات","محمودآباد","مراغه","مراوه تپه","مرند","مرودشت","مریوان","مسجدسلیمان","مشگین شهر","مشهد","ملارد","ملایر","ملکان","ملکشاهی","ممسنی","منوجان","مه ولات","مهاباد","مهدی شهر","مهر","مهران","مهرستان","مهریز","میامی","میاندوآب","میاندورود","میانه","میبد","میرجاوه","میناب","مینودشت","نایین","نجف آباد","نرماشیر","نطنز","نظرآباد","نقده","نکا","نمین","نور","نوشهر","نهاوند","نهبندان","نی ریز","نیر","نیشابور","نیک شهر","نیمروز","ورامین","ورزقان","هامون","هرسین","هریس","هشترود","هفتکل","هلیلان","همدان","هندیجان","هوراند","هویزه","هیرمند","یزد"];
        $province_ids = [13,17,6,18,1,15,4,24,25,25,28,13,24,27,18,31,29,14,28,3,4,31,9,21,17,2,26,17,30,12,1,22,8,5,31,2,4,3,17,18,26,25,13,21,13,13,17,1,13,14,13,16,6,6,27,27,11,23,13,21,31,20,13,11,12,17,6,4,11,21,26,9,1,29,29,10,21,16,9,1,25,29,24,29,13,4,17,7,2,23,18,31,30,8,13,27,23,20,10,17,3,11,3,29,17,8,22,8,26,2,2,8,18,11,1,11,11,24,31,16,28,2,27,7,30,8,4,22,12,29,11,1,7,22,27,11,17,21,4,1,2,27,16,2,23,6,26,11,29,13,31,16,9,1,14,17,26,17,14,13,17,3,11,29,28,4,17,28,11,4,4,10,11,2,17,22,15,11,11,30,10,6,13,13,7,7,16,26,16,28,8,23,26,4,20,6,7,7,20,21,12,16,27,13,13,24,21,8,30,17,25,11,25,21,22,29,25,21,25,26,8,21,16,11,16,17,21,28,17,14,16,10,27,9,5,28,11,17,1,16,10,16,10,22,17,11,15,2,3,20,17,20,26,14,2,15,4,22,20,27,27,25,16,21,6,29,27,13,28,15,2,4,1,25,8,13,13,2,21,4,9,8,17,12,11,22,25,14,5,10,25,27,1,7,24,21,9,12,21,30,17,28,10,5,4,4,27,11,17,4,16,25,21,17,8,11,27,10,8,8,20,18,29,22,16,21,19,11,17,13,17,4,11,20,30,5,24,21,22,11,27,24,1,28,16,7,22,17,3,17,21,26,9,11,23,21,9,24,13,23,17,24,15,12,3,4,27,24,11,7,24,22,17,13,17,25,9,4,23,25,23,25,2,12,14,4,28,27,1,24,1,17,20,13,3,11,8,30,1,6,17,21,11,2,15,17,6,16,31,15,2,27,1,31,16,29,24,4,4,21,4,5,2,27,3,27,27,30,10,17,3,11,16,16,8,1,16,22,1,1,13,6,30,13,1,13,16,31];
        for ($i = 0; $i < count($names); $i++) {
            DB::table('cities')->insert([
                'name' => $names[$i],
                'provinces_id' => $province_ids[$i],
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s')
            ]);
        }
    }
}
